{
  "title": "Сommemoration 6-month",
  "description": "After a person passes away, the first six-month period is\n         quite difficult for relatives. This is the time to come to terms with the loss and\n         continue living, but in another way. A great comfort is given by memories of the deceased\n         and frequent prayers for his soul.A wake in six months after death is not necessary in\n         terms of six months after death are optional in terms of church canons. It is a gradually\n         formed folk tradition. Therefore, it is up to the Orthodox to decide how to memorialize\n         for six months after death.It is an arbitrary date, there are no \"soul events\" associated\n         with it, no special ecclesiastical actions. The Orthodox Church does not forbid\n         commemoration of the deceased at any time, if there is the Orthodox Church does not\n         forbid to commemorate the deceased at any time, if there is a wish, even daily. If there\n         is a desire and possibility, in six months it is possible to organize memorial meal or\n         order a memorial service in the church. What is the best way to remember the deceased in\n         half a year? Of the most important of the church commemorations is the Divine Liturgy,\n         at which the Bloodless Sacrifice to God. Also on this day it is desirable to order a\n         special memorial service - a memorial service. Arranging a it is necessary to remember\n         that it is not a festive feast six months after death. Therefore, there is nothing bad\n         and not reprehensible, if the food will be modest, without gastronomic excesses. The main\n         is not the dishes on the table, but the memory of the deceased. The Church encourages not\n         to commemorate with alcohol, so as not to turn the memorial service into a binge. Wine is\n         not conducive to a prayerful mood. For the memorial meal Kutya (koliv) is considered\n         obligatory according to folk tradition.Half a year is not a canonical date for so the\n         absence of kutya on the menu is quite acceptable. The presence of other dishes depends\n         mainly on the presence of other dishes depends mainly on the time of year and whether or\n         not there is a fast at that time. Local traditions also influence. It can be vegetable\n         salads, noodle soup, meat and fish dishes, pancakes, kissel. The main point of a wake is\n         to remember the deceased and to pray for him or her together.",
  "actionsList": ""
}