package com.example.calculyatorpominok.utils

const val THIRD_DAY_DESCRIPTION = """Поминки после похорон на третий день традиционно связывают с 
чудесным воскрешением Иисуса Христа и образом Пресвятой Троицы. В течение первых двух дней после 
смерти душа находится на земле возле родных и посещает места, которые были ей дороги при жизни. И 
только на третий день происходит ее вознесение на небо, где она предстает перед Господом. Родные в 
этот день накрывают поминальный стол. Это происходит сразу или спустя некоторое время после того, 
как закончится отпевание либо гражданская панихида и похороны. Трапеза проводится не спеша, каждый 
из пришедших может высказаться, рассказать что-то хорошее об усопшем, выразить свое горе.
Местом проведения поминок может служить как дом умершего, так и кафе, ресторан, банкетный зал, 
специально снятые для этой церемонии. При этом существует несколько правил, которых следует 
придерживаться:
1. Прийти на обед может любой человек, который хочет проводить усопшего в последний путь.
2. Перед тем как приступить к трапезе, читают молитву «Отче наш».
3. Если на обеде присутствует священнослужитель, то он проводит заупокойную литургию и благословляет пищу.
4. Всех присутствующих рассаживают за столом на отдельные места.
5. Первым блюдом подается кутья, освященная в храме во время прощальной панихиды.
6. Перед тем как подадут сладкое, присутствующие исполняют стихиру на глас 6.
7. Обед завершается приемом последнего блюда и заупокойной чаши, а также принесением благодарения."""


const val NINTH_DAY_DESCRIPTION = """Отсчет 9 девяти суток ведут со дня смерти человека. По традиции 
в этот день помянуть покойного приходят только его родные и близкие. В узком семейном кругу 
православные вспоминают о лучших деяниях покойного, читают молитвы. А также посещают кладбище, 
облагораживают могилу, приносят новые цветы. Поминки на девятый день после похорон проводят в честь 
девяти ангельских чинов, служителей Бога, которые передают ему просьбы о помиловании умершего. Обряд
поминок и молитвы о близком человеке помогают душе усопшего получить благословение Всевышнего и 
попасть в Рай. В этот день, согласно православным канонам, пышный поминальный обед устраивать 
не обязательно. Близкие люди могут просто собраться у могилы и помолиться за усопшего. Если же 
решено накрыть стол, то посторонних на поминки не приглашают. А всю оставшуюся еду следует раздать 
нуждающимся и нищим."""

const val FORTIETH_DAY_DESCRIPTION = """На сороковой день душа преставившегося вновь возвращается в 
его дом, чтобы затем через сутки навсегда покинуть его и предстать перед Господом, который примет 
окончательное решение о ее судьбе. Между 9 и 40 днем она находится в Аду, где наблюдает, как 
страдают грешники. Согласно поверьям, если душа не обрела покой, то она навечно остается в доме, 
так как путь на небо для нее закрыт. Чтобы помочь духу покойного успокоиться, облегчить его 
страдания, загладить его грехи в этот день, устраивают сороковины. Родные, друзья и знакомые вновь 
собираются, чтобы помянуть усопшего, поговорить о нем и его жизни, помолиться за него.
Но помочь близкому и родному человеку, который ушел в иной мир, можно лишь четко придерживаясь 
установленных правил:
1. В этот день необходимо обязательно заказать молебен, который принято служить по умершему на 40 
дней – сорокоуст. Все родным и близким также стоит помолиться о душе покойного.
2. Не стоит превращать поминальный обед в застолье и вести пустые разговоры.
3. Согласно православным традициям, на поминках нельзя употреблять спиртные напитки, петь и 
веселиться.
4. Тем, кто хочет поддержать душу родного человека, священнослужители рекомендуют хоть на один день 
принести в жертву себя, отказавшись от какой-либо вредной привычки, к примеру чревоугодия, курения.
Поминальный стол на 40 дней накрывают так же, как и во время поминок после похорон. Кутья, блины и 
компот обязательны. Можно разнообразить трапезу и другими блюдами."""

const val ONE_YEAR_DESCRIPTION = """Первая годовщина смерти – это чрезвычайно значимое событие для 
всех родственников, близких и друзей усопшего. На такую дату принято собираться вместе и делиться 
добрыми воспоминаниями об умершем, одновременно поддерживая друг друга. Важно понимать, что первые 
12 месяцев являются по сути адаптационными, поскольку люди постепенно свыкаются с мыслью о смерти 
человека.
Каких-либо точных правил и процедур поминок не существует, так что родственники самостоятельно 
решают, как именно и где им отметить данное мероприятие. Ограничений по гостям также не существует, 
поскольку приглашать можно любого человека, которого родственники посчитают нужным и значимым на 
данном мероприятии.
Особое внимание следует уделить организационным мероприятиям. Прежде всего, стоит определиться с 
местом проведения поминок. Это может быть квартира, частный дом или же кафе или ресторан, в 
зависимости от числа приглашенных, а также пожеланий близких родственников. Нередко местом встречи 
для поминок усопшего является то, где он предпочитал быть чаще всего. Таким местом может быть дача, 
загородный дом, горы, лес, озеро, река.
Встретившись, люди делятся приятными моментами и воспоминаниями об умершем. Нужно отметить, что 
приглашать всегда следует только тех людей, с которыми родственникам будет действительно приятно 
общаться. То есть речь идет о тех людях, которые действительно любили и уважали умершего, относились
 к нему хорошо, были друзьями, близкими и хорошими коллегами."""

